Donkey_Ear/app/views/tweets/_tweet.html.erb

INSERT INTO "tweets" ("content", "isAnonymous", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asdsad"], ["isAnonymous", "t"], ["user_id", 3], ["created_at", "2017-04-24 21:03:23.405549"], ["updated_at", "2017-04-24 21:03:23.405549"]]
---
    <div class="right-content">
      <span><%= tweet.created_at %></span>