Donkey_Ear/app/views/tweets/create.js.erb

	$("#feed").prepend("<%=j render @tweet %>");
  $("#tweets-count").html("<%= current_user.tweets.count %>");
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 4]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 4]]