Donkey_Ear/app/views/tweets/destroy.js.erb

DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 28]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 4]]
---
<% if @tweet.destroy %>
  $("#tweet-<%= @tweet_id %>").remove();
  $("#tweets-count").html("<%= current_user.tweets.count %>");