Donkey_Ear/app/views/messages/create.js.erb

<% if @message.save %>
---
INSERT INTO "messages" ("content", "creator_id", "receiptor_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "asd"], ["creator_id", 4], ["receiptor_id", 5], ["chat_id", 2], ["created_at", "2017-04-29 21:08:56.565380"], ["updated_at", "2017-04-29 21:08:56.565380"]]