Donkey_Ear/app/controllers/chats_controller.rb

  def index
    @chats = Chat.where("user1_id = ? OR user2_id = ?", current_user.id, current_user.id)
---
SELECT  "chats".* FROM "chats" WHERE (user1_id = 4 OR user2_id = 4)  ORDER BY "chats"."id" DESC LIMIT 1

  def show
    set_chat
    @chats = Chat.where("user1_id = ? OR user2_id = ?", current_user.id, current_user.id)
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @participant = User.find(params[:participant_id])
    @chat = Chat.create(user1: current_user, user2: @participant)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
INSERT INTO "chats" ("user1_id", "user2_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user1_id", 6], ["user2_id", 3], ["created_at", "2017-04-29 19:23:24.302443"], ["updated_at", "2017-04-29 19:23:24.302443"]]