Donkey_Ear/app/controllers/find_users_controller.rb

SELECT "users".* FROM "users" WHERE (name = 'testname')
---
  def index
    @users = User.where("name = ?", params[:search_name])