Donkey_Ear/app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params) do |message|
      message.creator = current_user
      chat = Chat.find(params[:chat_id])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 4]]