Donkey_Ear/app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
INSERT INTO "relationships" ("user_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["follower_id", 3], ["created_at", "2017-04-25 21:20:27.711167"], ["updated_at", "2017-04-25 21:20:27.711167"]]
---
  def create
    @followee = User.find(params[:followee_id])
    @relationship = Relationship.create(user: @followee, follower: current_user)

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 3]]
---
  def destroy
    @relationship = Relationship.find(params[:id])
    @followee = User.find(@relationship.user_id)
    @relationship.destroy