Donkey_Ear/app/controllers/tweets_controller.rb

INSERT INTO "anonymous_profiles" ("user_id", "name", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["name", "kiwi0"], ["picture", "/assets/kiwi.png"], ["created_at", "2017-04-28 04:34:02.434747"], ["updated_at", "2017-04-28 04:34:02.434747"]]
INSERT INTO "tweets" ("content", "isAnonymous", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asdsad"], ["isAnonymous", "t"], ["user_id", 3], ["created_at", "2017-04-24 21:03:23.405549"], ["updated_at", "2017-04-24 21:03:23.405549"]]
---
	def create
		@tweet = Tweet.new(tweet_params) do |tweet|
			tweet.user = current_user

      if tweet.isAnonymous
        @anonymous_profile = tweet.user.anonymous_profile
        unless @anonymous_profile
          anonymous_name = get_anonymous_name(current_user.id)
          anonymous_picture_url = get_anonymous_picture_url(current_user.id)
          @anonymous_profile = AnonymousProfile.create({:user => current_user, :name => anonymous_name, :picture => anonymous_picture_url})

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 28]]
---
  def destroy
    @tweet = Tweet.find(params[:id])