Donkey_Ear/app/controllers/userhome_controller.rb

SELECT "tweets".* FROM "tweets" WHERE (user_id = 4 OR user_id in (3))  ORDER BY created_at DESC
---
	def index
      @following_users_ids = current_user.following_ids
    	@tweets = Tweet.where("user_id = ? OR user_id in (?)", current_user, @following_users_ids).order('created_at DESC')