Donkey_Ear/app/controllers/users_controller.rb

  def update
    current_user.update(user_params)
---
UPDATE "users" SET "picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["picture", "background.png"], ["updated_at", "2017-04-26 20:48:38.400790"], ["id", 4]]

  def set_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]