Donkey_Ear/app/views/partials/_user_card.html.erb

SELECT "tweets".* FROM "tweets" WHERE (user_id = 4 OR user_id in (3))  ORDER BY created_at DESC
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 4]]
---
              <h5><b>Tweets</b></h5>
              <h4 id="tweets-count"><%= @user.tweets.count %></h4>