Donkey_Ear/app/views/relationships/create.js.erb

INSERT INTO "relationships" ("user_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["follower_id", 3], ["created_at", "2017-04-25 21:20:27.711167"], ["updated_at", "2017-04-25 21:20:27.711167"]]
---
<% if @relationship.save %>